wrk_bench/rust_warp.txt
Running 1m test @ http://localhost:8080
  4 threads and 1000 connections
  Thread calibration: mean lat.: 2.115ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.065ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.942ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.005ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.85ms    1.03ms  20.98ms   77.74%
    Req/Sec    15.87k     2.68k   29.10k    72.57%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.67ms
 75.000%    2.28ms
 90.000%    3.04ms
 99.000%    5.42ms
 99.900%    9.26ms
 99.990%   14.02ms
 99.999%   17.55ms
100.000%   20.99ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.077     0.000000            2         1.00
       0.809     0.100000       292850         1.11
       1.053     0.200000       586004         1.25
       1.267     0.300000       878426         1.43
       1.468     0.400000      1171156         1.67
       1.667     0.500000      1463121         2.00
       1.773     0.550000      1609678         2.22
       1.885     0.600000      1756111         2.50
       2.003     0.650000      1901365         2.86
       2.133     0.700000      2048979         3.33
       2.275     0.750000      2193733         4.00
       2.359     0.775000      2268433         4.44
       2.451     0.800000      2340122         5.00
       2.559     0.825000      2413232         5.71
       2.687     0.850000      2486756         6.67
       2.843     0.875000      2560065         8.00
       2.933     0.887500      2596123         8.89
       3.035     0.900000      2633063        10.00
       3.143     0.912500      2669062        11.43
       3.267     0.925000      2705896        13.33
       3.417     0.937500      2742584        16.00
       3.507     0.943750      2760508        17.78
       3.615     0.950000      2778712        20.00
       3.745     0.956250      2797029        22.86
       3.903     0.962500      2815309        26.67
       4.095     0.968750      2833611        32.00
       4.207     0.971875      2842841        35.56
       4.335     0.975000      2852040        40.00
       4.479     0.978125      2861102        45.71
       4.659     0.981250      2870260        53.33
       4.875     0.984375      2879356        64.00
       4.999     0.985938      2883848        71.11
       5.147     0.987500      2888449        80.00
       5.311     0.989062      2893008        91.43
       5.507     0.990625      2897569       106.67
       5.747     0.992188      2902134       128.00
       5.895     0.992969      2904406       142.22
       6.067     0.993750      2906734       160.00
       6.255     0.994531      2908985       182.86
       6.467     0.995313      2911251       213.33
       6.755     0.996094      2913560       256.00
       6.923     0.996484      2914677       284.44
       7.119     0.996875      2915832       320.00
       7.355     0.997266      2916965       365.71
       7.615     0.997656      2918112       426.67
       7.967     0.998047      2919256       512.00
       8.163     0.998242      2919829       568.89
       8.399     0.998437      2920392       640.00
       8.647     0.998633      2920965       731.43
       8.967     0.998828      2921546       853.33
       9.311     0.999023      2922104      1024.00
       9.527     0.999121      2922402      1137.78
       9.711     0.999219      2922682      1280.00
       9.959     0.999316      2922961      1462.86
      10.279     0.999414      2923247      1706.67
      10.639     0.999512      2923535      2048.00
      10.847     0.999561      2923676      2275.56
      11.079     0.999609      2923818      2560.00
      11.359     0.999658      2923962      2925.71
      11.663     0.999707      2924106      3413.33
      12.015     0.999756      2924247      4096.00
      12.199     0.999780      2924322      4551.11
      12.423     0.999805      2924389      5120.00
      12.887     0.999829      2924461      5851.43
      13.343     0.999854      2924533      6826.67
      13.727     0.999878      2924605      8192.00
      13.879     0.999890      2924640      9102.22
      14.079     0.999902      2924675     10240.00
      14.327     0.999915      2924711     11702.86
      14.615     0.999927      2924746     13653.33
      14.999     0.999939      2924782     16384.00
      15.159     0.999945      2924800     18204.44
      15.359     0.999951      2924818     20480.00
      15.487     0.999957      2924836     23405.71
      15.679     0.999963      2924853     27306.67
      16.095     0.999969      2924871     32768.00
      16.255     0.999973      2924880     36408.89
      16.431     0.999976      2924889     40960.00
      16.767     0.999979      2924898     46811.43
      16.943     0.999982      2924908     54613.33
      17.151     0.999985      2924916     65536.00
      17.247     0.999986      2924920     72817.78
      17.375     0.999988      2924926     81920.00
      17.471     0.999989      2924930     93622.86
      17.647     0.999991      2924934    109226.67
      17.807     0.999992      2924938    131072.00
      17.903     0.999993      2924940    145635.56
      17.951     0.999994      2924943    163840.00
      18.095     0.999995      2924946    187245.71
      18.111     0.999995      2924947    218453.33
      18.207     0.999996      2924949    262144.00
      18.287     0.999997      2924950    291271.11
      18.431     0.999997      2924952    327680.00
      18.543     0.999997      2924953    374491.43
      18.703     0.999998      2924954    436906.67
      18.879     0.999998      2924955    524288.00
      18.879     0.999998      2924955    582542.22
      19.039     0.999998      2924956    655360.00
      19.471     0.999999      2924957    748982.86
      19.471     0.999999      2924957    873813.33
      19.743     0.999999      2924958   1048576.00
      19.743     0.999999      2924958   1165084.44
      19.743     0.999999      2924958   1310720.00
      20.143     0.999999      2924959   1497965.71
      20.143     0.999999      2924959   1747626.67
      20.143     1.000000      2924959   2097152.00
      20.143     1.000000      2924959   2330168.89
      20.143     1.000000      2924959   2621440.00
      20.991     1.000000      2924960   2995931.43
      20.991     1.000000      2924960          inf
#[Mean    =        1.845, StdDeviation   =        1.028]
#[Max     =       20.976, Total count    =      2924960]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3542925 requests in 1.00m, 7.17GB read
Requests/sec:  59047.55
Transfer/sec:    122.31MB