wrk_bench/rust_warp_1ms_delay.txt
Running 1m test @ http://localhost:8080
  4 threads and 1000 connections
  Thread calibration: mean lat.: 4.255ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.431ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.386ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.347ms, rate sampling interval: 11ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.02ms    1.74ms  40.22ms   90.32%
    Req/Sec    15.73k     2.96k   35.40k    69.60%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.68ms
 75.000%    4.41ms
 90.000%    5.38ms
 99.000%   11.57ms
 99.900%   19.74ms
 99.990%   26.94ms
 99.999%   33.66ms
100.000%   40.26ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.294     0.000000            1         1.00
       2.661     0.100000       293931         1.11
       2.943     0.200000       585940         1.25
       3.189     0.300000       878259         1.43
       3.431     0.400000      1171282         1.67
       3.679     0.500000      1464214         2.00
       3.807     0.550000      1609191         2.22
       3.941     0.600000      1756067         2.50
       4.081     0.650000      1901590         2.86
       4.235     0.700000      2050780         3.33
       4.407     0.750000      2195027         4.00
       4.511     0.775000      2268993         4.44
       4.627     0.800000      2340072         5.00
       4.771     0.825000      2414988         5.71
       4.935     0.850000      2486436         6.67
       5.135     0.875000      2560374         8.00
       5.247     0.887500      2596267         8.89
       5.383     0.900000      2633347        10.00
       5.547     0.912500      2669152        11.43
       5.767     0.925000      2705884        13.33
       6.075     0.937500      2742194        16.00
       6.275     0.943750      2760464        17.78
       6.535     0.950000      2778699        20.00
       6.899     0.956250      2797055        22.86
       7.355     0.962500      2815255        26.67
       7.919     0.968750      2833588        32.00
       8.247     0.971875      2842802        35.56
       8.599     0.975000      2851829        40.00
       9.015     0.978125      2861051        45.71
       9.487     0.981250      2870095        53.33
      10.071     0.984375      2879297        64.00
      10.415     0.985938      2883852        71.11
      10.799     0.987500      2888370        80.00
      11.255     0.989062      2892943        91.43
      11.807     0.990625      2897545       106.67
      12.439     0.992188      2902068       128.00
      12.823     0.992969      2904377       142.22
      13.215     0.993750      2906636       160.00
      13.679     0.994531      2908929       182.86
      14.223     0.995313      2911215       213.33
      14.911     0.996094      2913485       256.00
      15.303     0.996484      2914646       284.44
      15.743     0.996875      2915774       320.00
      16.255     0.997266      2916927       365.71
      16.847     0.997656      2918077       426.67
      17.471     0.998047      2919200       512.00
      17.823     0.998242      2919768       568.89
      18.239     0.998437      2920350       640.00
      18.703     0.998633      2920918       731.43
      19.215     0.998828      2921489       853.33
      19.823     0.999023      2922059      1024.00
      20.143     0.999121      2922335      1137.78
      20.591     0.999219      2922624      1280.00
      21.023     0.999316      2922907      1462.86
      21.567     0.999414      2923198      1706.67
      22.095     0.999512      2923478      2048.00
      22.367     0.999561      2923625      2275.56
      22.687     0.999609      2923763      2560.00
      23.119     0.999658      2923909      2925.71
      23.615     0.999707      2924052      3413.33
      24.175     0.999756      2924191      4096.00
      24.495     0.999780      2924270      4551.11
      24.799     0.999805      2924335      5120.00
      25.247     0.999829      2924407      5851.43
      25.791     0.999854      2924479      6826.67
      26.415     0.999878      2924548      8192.00
      26.719     0.999890      2924588      9102.22
      27.023     0.999902      2924621     10240.00
      27.327     0.999915      2924660     11702.86
      27.711     0.999927      2924691     13653.33
      28.335     0.999939      2924727     16384.00
      28.767     0.999945      2924746     18204.44
      29.087     0.999951      2924764     20480.00
      29.727     0.999957      2924782     23405.71
      30.223     0.999963      2924798     27306.67
      30.863     0.999969      2924817     32768.00
      31.263     0.999973      2924825     36408.89
      32.095     0.999976      2924834     40960.00
      32.623     0.999979      2924843     46811.43
      32.863     0.999982      2924852     54613.33
      33.055     0.999985      2924861     65536.00
      33.215     0.999986      2924865     72817.78
      33.503     0.999988      2924871     81920.00
      33.567     0.999989      2924874     93622.86
      33.759     0.999991      2924879    109226.67
      33.919     0.999992      2924883    131072.00
      33.951     0.999993      2924885    145635.56
      34.335     0.999994      2924888    163840.00
      35.199     0.999995      2924890    187245.71
      35.871     0.999995      2924892    218453.33
      36.319     0.999996      2924894    262144.00
      36.991     0.999997      2924895    291271.11
      37.791     0.999997      2924897    327680.00
      38.111     0.999997      2924898    374491.43
      38.399     0.999998      2924899    436906.67
      38.591     0.999998      2924900    524288.00
      38.591     0.999998      2924900    582542.22
      38.623     0.999998      2924901    655360.00
      38.975     0.999999      2924902    748982.86
      38.975     0.999999      2924902    873813.33
      39.007     0.999999      2924903   1048576.00
      39.007     0.999999      2924903   1165084.44
      39.007     0.999999      2924903   1310720.00
      39.167     0.999999      2924904   1497965.71
      39.167     0.999999      2924904   1747626.67
      39.167     1.000000      2924904   2097152.00
      39.167     1.000000      2924904   2330168.89
      39.167     1.000000      2924904   2621440.00
      40.255     1.000000      2924905   2995931.43
      40.255     1.000000      2924905          inf
#[Mean    =        4.017, StdDeviation   =        1.736]
#[Max     =       40.224, Total count    =      2924905]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3543057 requests in 1.00m, 7.17GB read
Requests/sec:  59051.15
Transfer/sec:    122.32MB